# WriteXMLFile

## Description
Writes an XML file.

```pascal
FUNCTION WriteXMLFile(
				XMLHandle : LONGINT;
				whichPath : INTEGER;
				filename  : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.WriteXMLFile(XMLHandle, whichPath, filename):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|whichPath|INTEGER||
|filename|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML